{
    "WBUI2": {
        "settings": {
            "OpenButton": 0,
            "HideIcon": true,
            "HideIconAfter": 600,
            "IconURL": "https://raw.githubusercontent.com/Varlonec/wbuiasa/main/logoWBUI.png",
            "DisableIconText": false,
            "IconPosition": 2,
            "IconTextColor": 3,
            "OpenOnStart": true,
            "OpenOnStartOnlyNewPlayers": true,
            "UpdateInterval": 12
        },
        "tabs": [
            {
                "tab1": {
                    "layout": 1,
                    "buttontext": "О проекте",
                    "title1": "Добро пожаловать на проект PVE Room5 Ascended",
                    "text1": "Более пяти лет с вами. \nПроект состоит из нескольких серверов ARK и других игр.\n\nНа данный момент проект работает в тестовом режиме и возможны корректировки настроек. \nНовые моды будут постепенно добавляться по мере развития проекта. \n\nОбязательно создайте трайб. \nВ противном случае при некоторых обстоятельствах, админ не сможет оказать вам помощь. \n\nОзнакомьтесь пожалуйста с правилами нашего проекта в группе VK или Сервере дискорд \n\n\nВсе новости и актуальная информация находится в нашем Дискорде. \n\n\nВнутриигровой магазин вызывается кнопкой F2.\nДля пополнения баланса, обратитесь к Админу в дискорд или ВК. \n\nНа данный момент автоматичекий магазин находится в стадии разработки. \n\n\nВнутриигровой магазин вызывается кнопкой F2.\nКаждые 30 минут вы получаете по 1 кристалу.\nДля пополнения баланса, обратитесь к Админу в дискорд или ВК.\n\n\n По всем игровым вопросам не стесняйтесь писать в личные сообщения дискорда \n\nСпасибо что выбрали нас!",
                    "imageurl": "https://raw.githubusercontent.com/Varlonec/wbuiasa/main/logoWBUI.png"
                }
            },
            {
                "tab2": {
                    "layout": 2,
                    "buttontext": "Настройки",
                    "title1": "INI settings:",
                    "text1": "<TextStyle.LightBlue>Ini Header:</>\n\n\\[WBUI2]\n\n\nINI-Options:\n\nJsonURL=\"url\"  -  default: \"https://raw.githubusercontent.com/DC-Modding/WBUI2-Wiki/main/default.json\"\n\nYou have to host the file as \"raw\" somewhere and enter the URL to it wrapped in \" \". You can use github (linked below). After uploading the file you'll find a button called \"raw\". click the button and copy the URL. Or use any other hosting site which offers linking to a raw JSON output.\n\nFor a more detailed instruction checkout the Wiki linked down below.\n\n\nYou can trigger an update of the JSON via console command:\ncheat scriptcommand WBUI2 update",
                    "title2": "JSON settings:",
                    "text2": "OpenButton  -  0/1/2/3/4/5/6, default:0, 0=F1, 1=F2, 2=F3, 3=F4, 4=F5, 5=Delete, 6=Home  -  Determines the button the player needs to press to open the UI.\n\nHideIcon  -  true/false, default: false  -  If true the Icon in the bottom left corner vanishes after some time.\n\nHideIconAfter  -  integer, default: 60  -  Determines after how many seconds the Icon vanishes.\n\nIconURL  -  \"URL\", default: \"https://i.imgur.com/OZ6xOjY.png\"  -  You can upload a custom image somewhere (e.g. imgur, link down below) and it will be used as the Icon in the bottom left.\n\nDisableIconText  -  true/false, default:false  -  If true the text \"F1 for Info\" will not be displayed.\n\nIconPosition  -  0/1/2/3, default:0, 0=Top Left, 1=Top Right, 2=Bottom Right, 3=Bottom Left  -  Set the position of the Icon.\n\nIconTextColor  -  0/1/2/3/4/5/6/7/8, default:0, 0=Light Blue, 1=Red, 2=Green, 3=Blue, 4=Yellow, 5=Orange, 6=Violet, 7=Black, 8=White  -  Sets the color of the \"F1 For Info\" text.\n\nOpenOnStart  -  true/false, default: true  -  If true the UI will open automatically after the player spawned.\n\nOpenOnStartOnlyNewPlayers  -  true/false, default: true  -  If true the UI only opens automatically the first time the player spawns on the server.\n\nUpdateInterval  -  integer, default: 12  -  This value determines the time in hours the mod automatically pulls the JSON from the URL to update settings.\n\nGENERAL INFORMATION:\n\n\nFor the rest of the settings pls checkout the Wiki or the example JSON linked down below.\n\nIn order to pass the JSON-validation you have to use \"*backslash*n\" without a space to generate newlines. although the mod should handle regular newlines just fine.\n\nSpecial characters like \" have to be escaped with a *backslash*\n\nYou can trigger an update of the JSON via console command: \"cheat scriptcommand WBUI2 update\"\n\nBe careful with the file size of the images. The user have to download the images.",
                    "imageurl": "https://raw.githubusercontent.com/Varlonec/wbuiasa/main/logoWBUI.png"
                }
            },
            {
                "tab3": {
                    "layout": 3,
                    "buttontext": "Правила",
                    "title1": "Правила сервера",
                    "text1": "1. Любое оскорбление Администрации ведёт к пожизненному Бану.\n2. Запрещены оскорбления игроков, мат в чате.\n3. Запрещены Дискуссии и Надписи, относящиеся к политической, религиозной и расовой принадлежности. БАН без выяснений.\n4. У каждого племени должна быть только 1 база, и 1 водный загон(небольших размеров). Другие строения будут удалятся.\n5. Максимально ОГОРОЖЕННАЯ территория 50х50 фундаментов от стены до стены. Запрет на гигантские постройки (мосты, переходы). Нюансы оговариваются лично с Администрацией.\n6. Администрация не несёт ответственности за потерю вещей и животных при Обновлении, Краше Сервера, Вашей смерти и при использовании Модов и официальных обновлениях от Разработчиков.\n7. Запрещено использовать не нормативную лексику в названии Выживших/Племени/Животных. Удаление, без предупреждения!!!\n8. ШИПЫ и ТОМИЛКИ удаляются, без выяснений.\n9. Запрещается натравливать диких животных на базы других игроков, карается БАНОМ.\n10. Запрет строительства и огораживание территорий у Обелисков и респа ресурсов.\n11. Оставленные животные в лесах, полях, пещерах, обелисках и т.д. найденные Администрацией, будут удалены.\n12. Запрещена передача яиц/икринок от Донат животных, оставление Донат животных на спаривание без контроля. Удаляется Донат животное и все детёныши без восстановления!!!\n13. Запрещена продажа или передача потомства животных где присутствует Донатное, даже в 10 поколении. Данный трайб, будет наказан удалением ВСЕХ ДОНАТНЫХ животных, включая капсулы!!!\n14. При защите Дропа или Жилы на карте Extinction, не участвующий с начала защиты не имеет права вмешиваться в процесс и забирать дроп. Так же это касается за не согласованное вмешательство в процессы приручения Титанов. При нарушении данного правила, это будет считаться воровством и караться баном как минимум на 24 часа с частичной потерей имущества. Помощь в защите приветствуется, по согласованию с начинающими защиту игроками.\n15. Запрещено размещение спальников в пещерах. Штраф трайбу, за нарушение данного правила. Удаляем рандомно животное или постройку.\n16. Игроки которые поддерживают сервер(донатом), не имеют никаких привилегий перед другими игроками, к ним так же как и к остальным применяются все ПC (Правила сервера). За нарушение правил, наказание будет как и для всех.\n17. Любые потерянные вещи при игре не возвращаются Администрацией!!!",                   "imageurl": "https://raw.githubusercontent.com/Varlonec/wbuiasa/main/logoWBUI.png",
                    "imageurl": "https://raw.githubusercontent.com/Varlonec/wbuiasa/main/logoWBUI.png"                    
                }
            }
        ],
        "links": [
            {
                "link1": {
                    "text": "Discord",
                    "url": "https://discord.gg/vUBrgkTZ"
                }
            },
            {
                "link2": {
                    "text": "VK",
                    "url": "https://vk.com/ark.room5"
                }
            },
            {
                "link3": {
                    "text": "Донат",
                    "url": "https://room5.ru"
                }
            }
        ]
    }
}
